Revit 2027 API
NumberSystem.SetReferencePick Method
 Sets the reference pick.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetReferencePick(
	Reference referencePick
)
Public Sub SetReferencePick (
	referencePick As Reference
)
public:
void SetReferencePick(
	Reference^ referencePick
)
member SetReferencePick :
        referencePick : Reference -> unit
Parameters
referencePick Reference
 The pick to set.
Exceptions
Exception | Condition
ArgumentException |  The referencePick is not a valid reference.
ArgumentNullException |  A non-optional argument was null
Remarks
 It is suggested to get the new reference via GetNumberSystemReference() from the host element.
See Also
Reference
NumberSystem Class
Autodesk.Revit.DB Namespace